mod readme
